<?php
// +----------------------------------------------------------------------
// | 中犇单商户
// +----------------------------------------------------------------------
// | Copyright (c) 2019-2021 中犇科技 All rights reserved.
// +----------------------------------------------------------------------


/**
 * 插件配置信息
 */
return [
    ['type' => 'text', 'name' => 'AppID', 'title' => 'AppID'],
    ['type' => 'text', 'name' => 'AppSecret', 'title' => 'AppSecret'],
    ['type' => 'radio', 'name' => 'is_online', 'title' => '环境','extra'=>['测试','正式']],
];
