<?php
// +----------------------------------------------------------------------
// | 中犇单商户
// +----------------------------------------------------------------------
// | Copyright (c) 2019-2021 中犇科技 All rights reserved.
// +----------------------------------------------------------------------


/**
 * 插件配置信息
 */
return [
    //['type' => 'radio', 'name' => 'display', 'title' => '是否显示', 'extra'=> ['不显示','显示'], 'value' => 1],
    ['type' => 'radio', 'name' => 'is_first', 'title' => '是否优先使用', 'tips' => '调整是否优先使用该验证码', 'extra'=> ['次要','优先'], 'value' => 1],
];
