<?php
// +----------------------------------------------------------------------
// | 中犇单商户
// +----------------------------------------------------------------------
// | Copyright (c) 2019-2021 中犇科技 All rights reserved.
// +----------------------------------------------------------------------


/**
 * 插件配置信息
 */
return [
    ['type' => 'radio', 'name' => 'status', 'title' => '启用短信', 'tips' => '短信插件只能开启一个', 'extra' => ['1' => '开启', '0' => '关闭'], 'value'=>1],
    ['type' => 'text', 'name' => 'appkey', 'title' => 'accessKeyId'],
    ['type' => 'text', 'name' => 'secret', 'title' => 'accessKeySecret']
];